[v10.4]
1=Улучшенный механизм для сканирования остаточных файлов, позволяет очистить большее количество файлов и записей реестра
2=Расширенная база данных позволяет удалить больше 350 упрямых программ
3=Улучшенное средство для удаления неудаляемых программ позволяет более точно обнаружить программы с проблемами удаления
4=Улучшенный пользовательский интерфейс
5=Исправлены все известные ошибки

[v10.3]
1=Улучшенное сканирование остаточных файлов, позволяет очистить большее количество файлов и записей рееcтра
2=Улучшенный механизм удаления для более тщательного удаления ПО занимающего много дискового пространства
3=Расширенная база данных позволяет удалить еще 210 “упрямых” программ
4=Добавлена поддержка, позволяющая развернуть окно содержащее подробности, истории удалений и журнала установки
5=Исправлена проблема перенастройки в Windows 10
6=Исправлены все известные ошибки

[v10.2]
1=Улучшено Средство для удаления неудаляемых программ, что позволяет обнаруживать дополнительные проблемы с удалением программ установленных через Microsoft Installer
2=Увеличенная база данных для удаления дополнительных 240 "упрямых" программ
3=Улучшены алгоритмы сканирования остаточных файлов для поиска большего количества остатков после удаления программ
4=Оптимизированный Монитор установки, позволяет вести полный журнал установки при мониторинге обновлений программного обеспечения
5=Улучшен интерфейс обновления ПО для более удобного использования
6=Исправлены все известные ошибки

[v10.1]
1=Обновленный функционал удаления "упорных" программ для более простого удаления
2=Расширенная база данных для удаления еще 200 "упорных" программ
3=Добавлена возможность настройки, отображать ли параметр «Мощное удаление» в контекстном меню Windows
4=Добавлена возможность настройки, отображать ли системные компоненты: время выполнения в списке программ
5=Исправлена проблема с неточным определением размера программ и мониторингом нестабильной установки слишком больших программ
6=Исправлены все известные ошибки

[v10.0]
1=Увеличена скорость удаления на 50%
2=Улучшен алгоритм сканирования, теперь сканирование остаточных файлов после удаления программ результативнее на 30%
3=Улучшена функция Здоровье ПО, обеспечивающая поддержку блокировки всплывающих уведомлений в веб-браузерах
4=Расширенный функционал «монитор установки» помогает проводить мониторинг установки большего количества программ. Добавлена поддержка системных служб, запланированных задач и регистрации DLL
5=Оптимизирован алгоритм обнаружения программ для более точного обнаружения редко используемых программ и навязанных программ
6=Исправлена ошибка, из-за которой иногда появлялись неверные подсказки после обновления некоторых программ
7=Добавленаподдержка удаления более 40 «упрямых» программ, таких как MPC-HC, SpyHunter5, Avast Antivirus, Rockstar Games, IntelliJ IDEA и других
8=Новая поддержка обновления многоязычных версий некоторых популярных программ, таких как Firefox, WinRAR и Mozilla Thunderbird
9=Новая поддержка удаления плагинов из нового Microsoft Edge (Chromium)
10=Обновленный интерфейс
11=Две темы оформления: темная и светлая
12=Локализация: 38 языков
